using LibVLCSharp.Shared;
using MetadataExtractor;
using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using System.Text.RegularExpressions;
using System.Threading.Tasks;
using System.Web;

namespace VideoLessons.Models
{
    public static class SubtitlesTemplateModel
    {

        #region "NoSub"     

        public static string nosub = " 00:00:00 - Начало урока \r\n"
             +
                " 00:01:00 - Субтитры в процессе создания..";

        #endregion

        //несколько субтитров по старой методике


        #region "Обучение ProjectWise. Пользователи (Часть 1)"     

        public static string sub1 = " 00:00:00 - Организационные вопросы \r\n" +
 " 00:02:50 - Введение в ProjectWise \r\n" +
 " 00:04:50 - Connection  Client \r\n" +
 " 00:06:30 - ProjectWise Explorer. Запуск, подключение к источнику данных \r\n" +
 " 00:08:50 - Рабочий каталог на локальном диске \r\n" +
 " 00:11:00 - Изменение пароля \r\n" +
 " 00:11:20 - Пользовательский интерфейс ProjectWise Explorer \r\n" +
 " 00:15:20 - Вопросы по разделу 'Авторизация и интрефейс' \r\n" +
 " 00:16:50 - Практическое задание (Смена пароля, авторизация в Connection Client) \r\n" +
 " 00:26:50 - Управляемая среда ProjectWise (из чего состоит источник данных) \r\n" +
 " 00:28:20 - Папки и рабочие области (Рабочая область и ее атрибуты) \r\n" +
 " 00:31:08 - Типовая структура источника данных \r\n" +
 " 00:35:30 - Справочники \r\n" +
 " 00:37:10 - Права доступа \r\n" +
 " 00:38:35 - Уровни доступа (галочки) \r\n" +
 " 00:41:10 - Виды прав (папка/рабочий процесс) \r\n" +
 " 00:42:15 - Вопрос (группы доступа пользователей) \r\n" +
 " 00:45:15 - Создание папок и рабочих областей \r\n" +
 " 00:46:00 - Повышение до рабочей области \r\n" +
 " 00:50:00 - Справочники \r\n" +
 " 00:51:00 - Практическое задание и вопросы по разделу 'Папки и рабочие области' \r\n" +
 " 00:58:50 - DGN indexing \r\n" +
 " 01:00:40 - Документ ProjectWise \r\n" +
 " 01:03:50 - Выдача и возврат документа (и возможные обходные пути) \r\n" +
 " 01:12:20 - Вопрос (глубина версионности и интеграция бекапов) \r\n" +
 " 01:14:00 - Вопрос (ограничение времени работы с файлом) \r\n" +
 " 01:15:50 - Статусы документа \r\n" +
 " 01:16:40 - Атрибуты документа и оболочки \r\n" +
 " 01:20:45 - Вопрос (назначение оболочки для папки) \r\n" +
 " 01:21:15 - Вопрос (перенос файла) \r\n" +
 " 01:22:40 - Вопрос (создание оболочек) \r\n" +
 " 01:23:10 - Создание документа (перетаскивание) \r\n" +
 " 01:25:15 - Создание документа в оболочке \r\n" +
 " 01:26:35 - Мастер создания документа \r\n" +
 " 01:27:55 - Редактирование документа \r\n" +
 " 01:31:40 - Создание новой версии документа \r\n" +
 " 01:35:30 - Вопрос (объем фалов версий) \r\n" +
 " 01:37:00 - Вопрос (сравнение версий) \r\n" +
 " 01:40:00 - Редактирование атрибутов документа \r\n" +
 " 01:41:30 - Шаблоны документов \r\n" +
 " 01:44:10 - Практическое задание (создание и редактирование документа, редактирование атрибутов, создание документа по шаблону) \r\n" +
 " 01:45:00 - Вопрос (замена файла в документе) \r\n" +
 " 01:47:00 - Вопрос (назначение оболочки папке) \r\n" +
 " 01:51:00 - Вопрос (обновление информации) \r\n" +
 " 01:51:35 - Вопрос (подписка на обновления) \r\n" +
 " 01:55:30 - Вопрос (разница между 'Возврат' и 'Отправить изменения на сервер') \r\n" +
 " 01:56:00 - Разбор ошибки (не внеслись изменения после операции 'Возврат') \r\n" +
 " 01:58:00 - Разбор ошибки (Word) \r\n" +
 " 02:00:00 - Вопрос (комментарий при операции 'Возврат') \r\n" +
 " 02:01:10 - Вопрос (файл не изменен) \r\n" +
 " 02:05:30 - Вопрос (откат к строке из журнала аудита) \r\n" +
 " 02:06:05 - Вопрос (стрелочки в окне свойств документа) \r\n" +
 " 02:07:40 - Вопрос (разница между 'Выдача' и 'Открыть') \r\n" +
 " 02:08:50 - Вопрос (правильный механизм создания пробной версии файла) \r\n" +
 " 02:12:20 - Вопрос (редактирование старой версии документа) \r\n" +
 " 02:15:30 - Перерыв \r\n" +
 " 02:37:05 - Вопрос (выдача и возврат документов) \r\n" +
 " 02:39:50 - Вопрос (обозначение рабочих областей) \r\n" +
 " 02:40:40 - Вопрос (разница между оболочкой и рабочей областью) \r\n" +
 " 02:43:30 - Интегрированные приложения \r\n" +
 " 02:45:05 - Интеграция с Microsoft Word \r\n" +
 " 02:45:30 - Вопрос (Excel) \r\n" +
 " 02:48:45 - Интеграция с Microsoft \r\n" +
 " 02:52:20 - Журнал аудита \r\n" +
 " 02:53:15 - Поиск в ProjectWise \r\n" +
 " 02:53:35 - Быстрый поиск \r\n" +
 " 02:57:45 - Расширенный поиск \r\n" +
 " 02:59:30 - Сохранение поиска \r\n" +
 " 03:01:20 - Экспорт результатов поиска \r\n" +
 " 03:03:15 - Вопрос (адрес документа как его атрибут) \r\n" +
 " 03:03:05 - Вопрос (процент готовности файла как его атрибут) \r\n" +
 " 03:05:45 - Печать результатов поиска \r\n" +
 " 03:06:40 - Замечания к поискам \r\n" +
 " 03:08:00 - Вопрос (версии папок) \r\n" +
 " 03:09:00 - Экспорт документов \r\n" +
 " 03:15:50 - Вопрос (восстановление экспортированных документов) \r\n" +
 " 03:20:10 - Вопрос (обновление большого количества экспортированных документов) \r\n" +
 " 03:21:50 - Менеджер документов \r\n" +
 " 03:26:00 - Вопрос (экспорт как механизм бекапа) \r\n" +
 " 03:30:05 - Необходимость одновременной работы \r\n" +
 " 03:35:50 - Вопрос (интеграция с Autodesk) \r\n" +
 " 03:37:25 - Вопрос (напоминание в конце рабочего дня) \r\n" +
 " 03:38:45 - Вопрос (Datamine Micromine интеграция) \r\n" +
 " 03:40:30 - Практическое задание (поиск, экспорт, менеджер документов) \r\n" +
 " 03:42:10 - Необходимость Datamine Micromine в PW \r\n" +
 " 03:43:25 - Вопрос (сортировка документов в поиске) \r\n" +
 " 03:46:15 - Вопрос (редактирование и создание нового вида) \r\n" +
 " 03:49:50 - Вопрос (сохранение быстрого поиска) \r\n" +
 " 03:51:20 - Вопрос (расширенный поиск) \r\n" +
 " 03:56:05 - Вопрос (разница между оболочкой и рабочей областью) ";
        #endregion

        #region "Обучение ProjectWise. Пользователи (Часть 2)"

        public static string sub2 = " 00:00:58 - Версии и WiseCoordinator \r\n" +
 " 00:04:10 - Вертикальные приложения семейства Microstation \r\n" +
 " 00:04:30 - Зависимости моделей \r\n" +
 " 00:06:40 - Блоки конфигурации приложений \r\n" +
 " 00:11:20 - Вопрос (видимость на вкладке 'Зависимости') \r\n" +
 " 00:12:10 - Вопрос (кто редактирует и назначет конфигурационные блоки) \r\n" +
 " 00:16:45 - Вопрос (кто создает конфигурационные блоки) \r\n" +
 " 00:18:00 - Вопрос (смысл окна Зависимости моделей) \r\n" +
 " 00:23:15 - Работа в Microstation \r\n" +
 " 00:29:35 - Создание листа по прототипу в Microstation \r\n" +
 " 00:36:40 - Вопрос (автоматическая привязка штампа к формату) \r\n" +
 " 00:38:20 - Вопрос (как использовать несколько шаблонов) \r\n" +
 " 00:41:20 - Практическое задание (конфигурационные блоки) \r\n" +
 " 00:43:25 - Вопрос (как назначить конфигурационные блоки) \r\n" +
 " 00:45:30 - Вопрос (выдача заданий, планирование, согласование, электронная подпись) \r\n" +
 " 00:49:40 - Согласование документов (WiseCoordinator) \r\n" +
 " 00:52:25 - Рабочий процесс PW и жизненный цикл \r\n" +
 " 00:57:20 - Перерыв \r\n" +
 " 01:14:30 - Карточка сотрудника, заместители \r\n" +
 " 01:16:45 - Отделы  \r\n" +
 " 01:18:25 - Административная часть - обзор \r\n" +
 " 01:21:50 - Автоматизированное создание набора документов \r\n" +
 " 01:25:50 - Настройка маршрута и запуск рабочего процесса \r\n" +
 " 01:30:30 - Выполнение заданий \r\n" +
 " 01:32:50 - Перерыв на открытие второго PW \r\n" +
 " 01:34:40 - Выполнение заданий \r\n" +
 " 01:38:40 - Завершение процесса \r\n" +
 " 01:43:15 - Вопрос (журнал выданных заданий) \r\n" +
 " 01:46:40 - Вопрос (стадии и шаги заданий) \r\n" +
 " 01:50:35 - Вопрос (кто создает задания) \r\n" +
 " 01:53:00 - Вопрос (зависимости в наборах) \r\n" +
 " 01:53:50 - Вопрос (создание набора в задании) \r\n" +
 " 01:54:10 - Перерыв (установка модуля) \r\n" +
 " 01:55:45 - Вопрос (блокировка документов набора) \r\n" +
 " 01:58:10 - Перерыв (установка модуля) \r\n" +
 " 01:59:00 - Назначенные задания \r\n" +
 " 01:59:50 - Сложные маршруты \r\n" +
 " 02:01:10 - Вопрос (как принять задание с заблокированным документом) \r\n" +
 " 02:02:40 - Вопрос (как принять задание - кнопка перейти к документу) \r\n" +
 " 02:06:20 - Вопрос (комментарии и ссылки) \r\n" +
 " 02:08:35 - Вопрос (как назначить исполнителя на задание) \r\n" +
 " 02:11:20 - Данные пользователя \r\n" +
 " 02:14:18 - Вопрос (запустить ассоциированное приложение) \r\n" +
 " 02:15:50 - Вопрос (как выдать задание) \r\n" +
 " 02:18:45 - Вопрос (назначенные задания) \r\n" +
 " 02:18:58 - Вопрос (роли и шаблоны) \r\n" +
 " 02:20:00 - Вопрос (вкладка Процесс) \r\n" +
 " 02:20:30 - Вопрос (согласование в нескольких отделах) \r\n" +
 " 02:23:05 - Запись данных результатов согласования в атрибуты документа \r\n" +
 " 02:24:30 - Вопрос (параллельное и последовательное согласование) \r\n" +
 " 02:26:30 - Организационные вопросы ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 1, Часть 1)"

        public static string sub11 = " 00:00:00 - Система ProjectWise \r\n" +
 " 00:01:00 - Описание архитектуры системы \r\n" +
 " 00:02:08 - Службы \r\n" +
 " 00:02:55 - База данных \r\n" +
 " 00:03:25 - Пользовательский кэш данных \r\n" +
 " 00:04:37 - Настройка сетевого взаимодействия \r\n" +
 " 00:06:30 - Резервное копирование \r\n" +
 " 00:08:18 - Восстановление \r\n" +
 " 00:10:40 - Вопрос (версии программ) \r\n" +
 " 00:11:47 - Вопрос (бекап: остановка служб) \r\n" +
 " 00:12:20 - Вопрос (бекап: программа) \r\n" +
 " 00:12:55 - Вопрос (сервер: база и хранилище) \r\n" +
 " 00:14:45 - Вопрос (версия SQL) \r\n" +
 " 00:15:25 - ProjectWise Administrator \r\n" +
 " 00:15:40 - Вход в ProjectWise Administrator \r\n" +
 " 00:16:58 - Описание интерфейса ProjectWise Administrator \r\n" +
 " 00:18:40 - Упражнения и вопросы для освоения раздела \r\n" +
 " 00:19:40 - Источник данных в PW Administrator \r\n" +
 " 00:21:25 - Рабочие области \r\n" +
 " 00:21:45 - Разбор ошибки (вход в ProjectWise Administrator) \r\n" +
 " 00:23:35 - Рабочие области \r\n" +
 " 00:24:50 - Атрибуты рабочих областей \r\n" +
 " 00:25:05 - SQL запросы \r\n" +
 " 00:27:15 - Атрибуты рабочих областей \r\n" +
 " 00:28:40 - Вопрос (разница между оболочкой и рабочей областью) блок-схема) \r\n" +
 " 00:30:00 - SQL запросы \r\n" +
 " 00:32:45 - Создание и редактирование типов рабочих областей \r\n" +
 " 00:36:12 - Вопрос (создание нового атрибута: значение по умолчанию и выпадающий список) \r\n" +
 " 00:39:30 - Вопрос (разница между оболочкой и рабочей областью) \r\n" +
 " 00:40:20 - Атрибуты рабочих областей: правка, редактирование \r\n" +
 " 00:41:40 - Упражнения (создание рабочей области) \r\n" +
 " 00:42:20 - Вопрос (префикс WA) \r\n" +
 " 00:43:10 - Вопрос (все пропало в ProjectWise) \r\n" +
 " 00:44:00 - Справочники (демонстрация, ограничения) \r\n" +
 " 00:50:05 - Вопрос (создать свойство (атрибут) рабочей области) \r\n" +
 " 00:50:37 - Разбор ошибки (имя рабочей области) \r\n" +
 " 00:52:20 - Оболочки \r\n" +
 " 00:53:30 - Интерфейс по умолчанию \r\n" +
 " 00:56:10 - Атрибуты и дополнительные атрибуты (компоновка) \r\n" +
 " 00:57:22 - Специальный атрибут Обновить атрибуты (update_attributes) \r\n" +
 " 00:59:43 - Создание и редактирование оболочек \r\n" +
 " 01:01:07 - Создание атрибута (столбца) \r\n" +
 " 01:02:00 - Тип данных атрибута (столбца) \r\n" +
 " 01:03:55 - Свойства оболочки \r\n" +
 " 01:06:10 - Свойства атрибута \r\n" +
 " 01:12:08 - Компоновка атрибутов \r\n" +
 " 01:17:45 - Просмотр (тест) оболочки в ProjectWise \r\n" +
 " 01:20:20 - Вопрос (имя атрибута (столбца)) \r\n" +
 " 01:22:50 - Организационные вопросы \r\n" +
 " 01:24:20 - Вопрос (dll и sql функции) ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 1, Часть 2)"

        public static string sub12 = " 00:00:40 - База данных SQL \r\n" +
 " 00:07:25 - Службы сообщений. Просмотр сообщений в PW Explorer \r\n" +
 " 00:09:15 - Создание оповещений \r\n" +
 " 00:15:10 - Вопрос (отправка оповещений на почту) \r\n" +
 " 00:18:20 - Упражнения (создание оповещений) \r\n" +
 " 00:19:15 - Вопрос (список получателей) \r\n" +
 " 00:20:20 - Вопрос (почтовый клиент)  \r\n" +
 " 00:21:15 - Вопрос (повещения когда PW свернут) \r\n" +
 " 00:24:35 - Пользователи \r\n" +
 " 00:25:00 - Выбор пользователей по группам и спискам \r\n" +
 " 00:26:27 - Диалоговое окно управления пользователями и группами \r\n" +
 " 00:28:15 - Создание пользователя \r\n" +
 " 00:30:20 - Установки (создание пользователя) \r\n" +
 " 00:32:25 - Вопрос (Windows аутентификация) \r\n" +
 " 00:34:15 - Вопрос (импорт пользователей из Active Directory AD АД) \r\n" +
 " 00:36:30 - Установки (создание пользователя) \r\n" +
 " 00:39:30 - Значения по умолчанию \r\n" +
 " 00:41:25 - Вопрос (установки - папки пользователей) \r\n" +
 " 00:44:15 - Настройка прав \r\n" +
 " 00:45:30 - Упражнение (создание пользователя) \r\n" +
 " 00:46:40 - Вопрос (установка может высвобождать) \r\n" +
 " 00:47:25 - Вопрос (логическая аутентификация) \r\n" +
 " 00:47:55 - Вопрос (инструкция что значит каждая установка) \r\n" +
 " 00:48:45 - Вопрос (книга по ProjectWise Administrator) \r\n" +
 " 00:51:10 - Вопрос (приоритет между группами и установками в создании пользователя) \r\n" +
 " 00:54:10 - Вопрос (автоматическое управление доступом в ProjectWise) \r\n" +
 " 00:58:55 - Папки пользователей (закладки) \r\n" +
 " 01:03:30 - Группы и списки пользователей \r\n" +
 " 01:04:55 - Владение списком пользователей \r\n" +
 " 01:08:18 - Создание списка пользователей \r\n" +
 " 01:11:20 - Упражнения (создать список пользователей и назначить себя владельцем) \r\n" +
 " 01:11:35 - Вопрос (разница между вкладками Владельцы и Владелец) \r\n" +
 " 01:15:00 - Вопрос (вкладка Управляемая рабочая среда) \r\n" +
 " 01:16:40 - Вопрос (разница между Списком и Группой пользователей) \r\n" +
 " 01:18:00 - Конфигурационные блоки (переменные) \r\n" +
 " 01:24:00 - Рабочие среды (переменные) \r\n" +
 " 01:27:40 - Свойства конфигурационного блока (окно Блок параметров конфигурации, переменные) \r\n" +
 " 01:31:25 - Вопрос (создание штампа) \r\n" +
 " 01:35:00 - Вопрос (задание переменных и конфигурационных блоков вручную) \r\n" +
 " 01:36:48 - Вопрос (конфигурационные блоки устанавливаются на модель) \r\n" +
 " 01:37:16 - Вопрос (шаблон Word)  \r\n" +
 " 01:41:00 - Текст конфигурационного блока  \r\n" +
 " 01:41:30 - Вопрос (переменная проекта в конфигурационном блоке) \r\n" +
 " 01:47:40 - Вопрос (названия конфигурационных блоков) \r\n" +
 " 01:50:30 - Интеграция с приложениями \r\n" +
 " 01:51:40 - Создание приложения \r\n" +
 " 01:56:45 - Настройка приложений \r\n" +
 " 01:58:22 - Вопрос (слетает приложение) \r\n" +
 " 02:01:12 - Вопрос (откуда берется список приложений в ProjectWise Administrator) \r\n" +
 " 02:03:15 - Вопрос (добавить новое приложение, что будет если у пользователя нет ПО) \r\n" +
 " 02:06:55 - Вопрос (разные приложения одного расширения файла) \r\n" +
 " 02:12:50 - организационные вопросы ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 1, Часть 3)"

        public static string sub13 = " 00:00:00 - Хранилища \r\n" +
 " 00:01:30 - Создание хранилища \r\n" +
 " 00:03:30 - Использование хранилища \r\n" +
 " 00:06:15 - Вопрос (сетевые хранилища) \r\n" +
 " 00:08:10 - Вопрос (права на создание хранилища) \r\n" +
 " 00:09:20 - Вопрос (что хранится в хранилищие)  \r\n" +
 " 00:11:10 - Упражнения (Создание хранилища) \r\n" +
 " 00:16:00 - Вопрос (удаленные пользователи, ProjectWise Caching Server) \r\n" +
 " 00:19:20 - Вопрос (права на создание и удаление хранилища) \r\n" +
 " 00:22:00 - Права администраторов, доступ к PW Administrator, Restricted Administrator \r\n" +
 " 00:30:45 - Индексация документов, извлечение эскизов \r\n" +
 " 00:35:50 - Вопрос (служба Orchestration Framework Service, DGN Indexing) \r\n" +
 " 00:37:30 - Настройка пространственных функций \r\n" +
 " 00:46:30 - Экспорт/импорт данных между источниками данных \r\n" +
 " 00:48:30 - Export to AAM File Wizard \r\n" +
 " 00:54:15 - ProjectWise Explorer \r\n" +
 " 00:54:15 - Создание рабочей области по шаблону \r\n" +
 " 01:00:40 - Упражнения (создание проекта по шаблону) \r\n" +
 " 01:00:25 - Вопрос (где найти шаблон) \r\n" +
 " 01:02:35 - Вопрос (кнопка Проект ProjectWise, ProjectWise 365) \r\n" +
 " 01:04:45 - Вопрос (безопасность рабочей области - тип защиты) \r\n" +
 " 1:11:25  - Управление правами доступа ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 1, Часть 4)"

        public static string sub14 = " 00:00:20 - Свойства источника данных (папка шаблонов рабочих областей) \r\n" +
 " 00:02:22 - Подходы к формированию проекта \r\n" +
 " 00:04:30 - Глобальное ограничение удаления \r\n" +
 " 00:09:00 - Создание стадий и рабочего процесса WiseCoordinator \r\n" +
 " 00:13:30 - Настройка прав доступа WiseCoordinator \r\n" +
 " 00:17:20 - Упражнения (создать рабочий процесс, права запрещающие редактирование) \r\n" +
 " 00:20:00 - Вопрос (настроить отчет - действия) \r\n" +
 " 00:24:30 - Вопрос (разница между праом на Чтение и Чтение файла) \r\n" +
 " 00:27:00 - Подготовка отделов и ролей \r\n" +
 " 00:42:20 - Просмотр и редактирование шаблонов рабочих процессов \r\n" +
 " 00:52:30 - Редактирование шагов и правил перехода  \r\n" +
 " 01:00:15 - Настройка заданий согласования \r\n" +
 " 01:07:30 - Редактирование шаблона - варианты ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 2, Часть 1)"

        public static string sub15 = " 00:00:30 - Мастер создания документа - свойства, настройки \r\n" +
 " 00:01:10 - Повторение стадии, отделы и роли \r\n" +
 " 00:03:25 - Шаблоны рабочих процессов \r\n" +
 " 00:05:10 - Суммировать результат \r\n" +
 " 00:10:30 - Цвета шагов \r\n" +
 " 00:12:00 - Создание процесса (задание в несколько отделов), подробности рабочего процесса  \r\n" +
 " 00:34:50 - Вопрос (интерфейс окна Подробности рабочего процесса) \r\n" +
 " 00:43:30 - Опции (возможен пропуск, выбор из отдела, роль, выбор пользователя, назначение пользователя из атрибута, выбор в задании) \r\n" +
 " 00:52:45 - Вопрос (отмена случайной ошибки, откат) \r\n" +
 " 00:57:30 - Комментарий, ссылка \r\n" +
 " 01:01:30 - Отклонение процесса, новый запуск \r\n" +
 " 01:03:00 - Создание набора \r\n" +
 " 01:05:50 - Вопрос (задание одному человеку) \r\n" +
 " 01:11:45 - Вопрос (экспорт отчета по согласованию) \r\n" +
 " 01:12:20 - Уведомления (высылать Email) \r\n" +
 " 01:14:15 - Вопрос (права на документ задания, блокировка документов из наборов) \r\n" +
 " 01:24:50 - Динамический отдел \r\n" +
 " 01:27:50 - Перерыв ";

        #endregion

        #region "Обучение ProjectWise. Администраторы (День 2, Часть 2)"

        public static string sub16 = " 00:00:00 - Наследование атрибутов рабочей области \r\n" +
 " 00:01:25 - Автоматическое создание набора \r\n" +
 " 00:02:00 - Автоматическое переименование документа \r\n" +
 " 00:04:30 - Вопрос (сервис отчетов, Report Builder) \r\n" +
 " 00:08:40 - Разбор ошибки (не создается задание) \r\n" +
 " 00:11:40 - Вопрос (наименование файла задания) \r\n" +
 " 00:17:25 - Вопрос (создание оболочки, Выбор таблицы базы данных, оболочка в шаблоне рабочего процесса) \r\n" +
 " 00:21:20 - Вопрос (атрибуты оболочки) \r\n" +
 " 00:26:00 - Разбор ошибки (не создается задание) \r\n" +
 " 00:32:45 - Вопрос (согласование администратором) \r\n" +
 " 00:36:45 - Вопрос (шаблоны рабочего процесса) \r\n" +
 " 00:40:50 - Вопрос (отделы и роли, списки) \r\n" +
 " 00:51:30 - Разбор ошибки (не создается задание) \r\n" +
 " 00:54:55 - Вопрос (запуск процесса) \r\n" +
 " 00:58:40 - Вопрос (статус задания) \r\n" +
 " 01:00:10 - Вопрос (название стадий, изменение шаблона рабочего процесса) \r\n" +
 " 01:06:30 - Разбор ошибки (не создается задание) \r\n" +
 " 01:06:55 - Вопрос (пересоздание учетки, смена фамилии) \r\n" +
 " 01:15:50 - Вопрос (рабочий процесс) \r\n" +
 " 01:24:10 - Вопрос (динамический отдел) \r\n" +
 " 01:28:00 - Вопрос (ход задания) ";

        #endregion


        #region "Обучение MicroStation. Администраторы. День 1_1"

        public static string sub21 = 
 " 0:12:40	- Видовые окна(экраны) \r\n" +
 " 0:14:32	- Увеличение, вращение, горячие клавиши \r\n" +
 " 0:16:50	- ниспадающее меню кнопок \r\n" +
 " 0:21:15	- вкладка вид, стили отображения  \r\n" +
 " 0:26:38	- Настройка отображения по стилю \r\n" +
 " 0:38:14	- Выравнивание видовых окон \r\n" +
 " 0:40:00	- кнопка атрибут вида (поверхостно) \r\n" +
 " 0:46:40	- отсечение объёма \r\n" +
 " 0:51:55	- Вопрос: настройка отсечения объёма \r\n" +
 " 0:52:40  - Ответ: настройка отсечения объёма \r\n" +
 " 1:12:56	- Привязка координат \r\n" +
 " 1:13:00	- Меню файл \r\n" +
 " 1:14:00	- Сохранение настроек \r\n" +
 " 1:16:00	- Настройки пользователя, кнопка Эск. \r\n" +
 " 1:18:20	- Сохранение настроек пользователя \r\n" +
 " 1:40:00	- ПКМ правая кнопка мыши \r\n" +
 " 1:53:30	- Установки файла, параметры файла проекта \r\n" +
 " 1:57:30	- свойства файла, размещение консолей на экране \r\n" +
 " 2:01:00	- Установки пользователя: инструментальная панель \r\n" +
 " 2:04:00	- Видовая панель \r\n" +
 " 2:08:00	- Поиск команд \r\n" +
 " 2:10:10	- выделение рамкой \r\n" +
 " 2:16:00	- Метка выбора, вкл/откл \r\n" +
 " 2:17:30	- командная строка \r\n" +
 " 2:19:20	- Проводник \r\n" +
 " 2:24:00	- Отоброжаемый набор \r\n" +
 " 2:34:00	- проводник по компонентам \r\n" +
 " 2:47:30	- преобразование файла в imodel для передачи с атрибутами \r\n" +
 " 2:51:30	- можно обрезать видео ";

        #endregion

        #region "Обучение MicroStation. Администраторы. День 1_2"

        public static string sub22 =
 " 0:04:00 - Свойства атрибутов, изменение, горячие клавиши \r\n" +
 " 0:10:00 - Создание объектов \r\n" +
 " 0:11:30 - Точки привязки \r\n" +
 " 0:14:00 - Настройкии мульти привязки \r\n" +
 " 0:20:00 - Слои настройки управление \r\n" +
 " 0:38:55 - Система координат триада ВСК \r\n" +
 " 0:44:00 - 3д построение \r\n" +
 " 0:50:30 - Режимы Accu Drow \r\n" +
 " 0:54:05 - Вопрос:фиксация координат" +
 " 0:56:48 - Вопрос: общая сетка координат \r\n" +
 " 0:58:40 - Варианты сборки \r\n" +
 " 1:00:12 - Обновление референсов" +
 " 1:13:50 - Вопрос построение линий 1/3 - 1/5 от объекта \r\n" +
 " 1:27:42 - Настройки Акку Дроу \r\n" +
 " 1:56:40 - Работа с 3д \r\n" +
 " 1:57:00 - Рисуем 3д деталь смарт лайн \r\n" +
 " 2:09:00 - Горячие клавиши Акку Дроу  \r\n" +
 " 2:11:15 - Замена размеров через свойства \r\n" +
 " 2:26:00 - Разделение элемента на отдельные составляющие \r\n" +
 " 2:29:00 - Объединение в область \r\n" +
 " 2:36:00 - Библиотека фрагментов (очень поверхостно) \r\n" +
 " 2:39:40 - Вкладка анализ пересечений \r\n" +
 " 2:41:00 - Упражнение 'сыр' \r\n" +
 " 3:00:00 - Перемешение, копирование паралельно заданному объекту \r\n" +
 " 3:02:20 - Скругление улов \r\n" +
 " 3:05:30 - Группировка, объединение  ";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 2_1"

        public static string sub23 =
 " 0:00:45	- Создание 3д объектов \r\n" +
 " 0:15:15	- Вопрос где вызвать AccuDraw \r\n" +
 " 0:18:00	- Горячие клавиши AccuDraw \r\n" +
 " 0:25:15	- Управление инструментальными панелями, найти инструментальную панель \r\n" +
 " 0:26:50	- Свойства элементов (атрибуты) \r\n" +
 " 0:29:00	- Заполнение, создание свойств элемента \r\n" +
 " 0:33:12	- Добавление в каталог Аэкосим из микростейшн\r\n" +
 " 0:49:00	- Горячие клавиши открыть/сохранить \r\n" +
 " 0:51:55	- Вопрос: настройка отсечения объёма" +
 " 0:50:30	- Библиотека фрагментов \r\n" +
 " 1:21:15	- Заполнение штампа \r\n" +
 " 1:24:05	- Комментарии Анатолия по заполнению тегов \r\n" +
 " 1:57:50	- Текст размер \r\n" +
 " 1:59:00	- Отсечение (вопрос от слушателя) \r\n" +
 " 2:00:15	- Редактор стиля текста \r\n" +
 " 2:01:10	- Зависла программа, перезагрузка" +
 " 2:14:00	- Настройка шрифта \r\n" +
 " 2:37:00	- Редактор текста (поля) автоматическое изменение ";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 2_2"

        public static string sub24 =
 " 0:00:40	- Символы \r\n" +
 " 0:13:00	- редактирование поля ввода данных \r\n" +
 " 0:14:20	- Размеры, стили размеров \r\n" +
 " 0:33:20	- Отображение размеров удаленного элемента, исправление \r\n" +
 " 0:39:00	- Копирование элементов \r\n" +
 " 0:48:45	- Терминаторы размерных линий \r\n" +
 " 0:54:30	- Размешение выноски с несколькими указателями \r\n" +
 " 0:58:00	- Метки \r\n" +
 " 1:10:00	- Размещение таблиц, настройки таблиц \r\n" +
 " 1:15:10	- Импорт таблиц из экселя \r\n" +
 " 1:17:30	- Анализ коллизий, менеджер коллизий \r\n" +
 " 1:57:20	- Изменение стилей размеров \r\n" +
 " 2:02:00	- Штриховки заливки \r\n" +
 " 2:06:00	- Журнал проекта \r\n" +
 " 2:11:30	- Создание чертежа  \r\n" +
 " 2:38:50	- Подключение файлов, ассоциативные модели \r\n" +
 " 2:46:00	- Слияние ассоциированных файлов в основную модель \r\n" +
 " 2:52:00	- Настройки референсов \r\n" +
 " 3:02:40	- Размещение на листе, сохраненный вид \r\n" +
 " 3:11:40	- Сохраненный вид, варианты размещения на листе ";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 3_1"

        public static string sub25 =
 " 0:06:20	- Создание разрезов из модели \r\n" +
 " 0:08:00	- Границы вида \r\n" +
 " 0:10:00	- Горячие клавиши, размещение модели \r\n" +
 " 0:14:30	- Добавление размеров к виду на чертеже (масштабы размеров) \r\n" +
 " 0:17:30	- Создание листа в моделе \r\n" +
 " 0:19:20	- Печать в пдф \r\n" +
 " 0:20:00	- Создание разреза/плана из модели, глубина вида, размещение на листе, размещение в разных масштабах \r\n" +
 " 1:15:30	- Узел. Размещенеие, создание, на листе \r\n" +
 " 1:25:00	- Изменение едениц измерения \r\n" +
 " 1:26:00	- Сетка реальности \r\n" +
 " 1:50:00	- Оформление чертежа размеры, выноски \r\n" +
 " 1:54:00	- Аннотации листа в модели ";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 3_2"

        public static string sub26 =
 " 0:01:00	- Сетка реальности. Пример \r\n" +
 " 0:04:00	- Cайт поддержки продуктов бентли, дистрибутивы \r\n" +
 " 0:09:35	- Организация прораммы \r\n" +
 " 0:16:07	- Папки локального размещения файлов \r\n" +
 " 0:19:30	- Файлы конфигурации. NotePad++ \r\n" +
 " 0:21:00	- Создание WorkSet \r\n" +
 " 0:26:05	- Пути прототипов \r\n" +
 " 0:41:30	- Стили текста (перемещение библиотеки) \r\n" +
 " 1:16:45	- Конфигурационные переменные (системные переменные) \r\n" +
 " 2:02:30	- Портал FAQ бентли комньюнити \r\n" +
 " 2:03:00	- Образовательный портал \r\n" +
 " 2:05:20	- Вопрос по работе с переменными, подходит для всей линейки продукции Бентли или нет. \r\n" +
 " 2:09:10	- Настройка ленты/кнопок \r\n" +
 " 2:11:15	- Создание кнопок \r\n" +
 " 2:19:36	- Создание библиотеки кнопок для всех пользователей \r\n" +
 " 2:56:00	- Создание планов разрезов, размещение на листе, отключение слоев в подгруденных референсах, настройка отображен";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 4_1"

        public static string sub27 =
 " 0:01:19	- Создание пользовательского стиля линий \r\n" +
 " 0:47:15	- Детализация символов (план/разрез) \r\n" +
 " 2:05:00	- Создание очета (упрощенная спецификация) \r\n" +
 " 2:39:00	- Печать листа \r\n" +
 " 2:51:00	- Включение/отключение слоев на листе перед выводом на печать ";


        #endregion

        #region "Обучение MicroStation. Администраторы. День 4_2"

        public static string sub28 =
 " 0:06:40	- Пакетная печать \r\n" +
 " 0:21:20	- Тест ";

        #endregion

        #region "Обучение MicroStation. Администраторы. День 4_3"

        public static string sub29 =
 " 0:00:00	- Разбор теста \r\n" +
 " 0:50:30	- Cамостоятельная работа по созданию листа, планов, разрезов ";

        #endregion


        #region "BRCM 1.1" 

        public static string sub31 =
 " 00:00:00 - Введение (назначение и возможности BRCM, обзор курса) \r\n" +
 " 00:06:50 - Стартовая страница \r\n" +
 " 00:07:50 - Создание нового проекта (рабочего набора) \r\n" +
 " 00:11:10 - Разбор ошибки (файл шаблона не найден) \r\n" +
 " 00:16:25 - Создание нового файла \r\n" +
 " 00:17:45 - Разбор ошибки (невозможно найти rcmProject.XML) \r\n" +
 " 00:18:35 - Регистрация модели по содержимому  \r\n" +
 " 00:25:30 - Именение содержимого модели  \r\n" +
 " 00:26:30 - Некоторые настройки программы  \r\n" +
 " 00:29:00 - Импорт списков кабелей и оборудования  \r\n" +
 " 00:30:10 - Импорт списка кабелей (файл Эксель) \r\n" +
 " 00:31:43 - Вопрос (жильность при импорте списка кабелей) \r\n" +
 " 00:32:40 - Импорт списка оборудования (файл Эксель) \r\n" +
 " 00:33:10 - Импорт списка кабелей (интерфейс) \r\n" +
 " 00:36:40 - Разбор ошибки (сбой при удаленном вызове процедуры) \r\n" +
 " 00:44:40 - Вопрос (работа с базой данных при импорте списка кабеле) \r\n" +
 " 00:46:20 - Импорт списка кабелей (интерфейс) - кратко  \r\n" +
 " 00:49:30 - Импорт списка кабелей - проверка успешности  \r\n" +
 " 00:51:05 - Импорт списка оборудования (интерфейс) \r\n" +
 " 00:55:35 - Вопрос (связь BRCM и ProjectWise) \r\n" +
 " 00:59:00 - Импорт списка оборудования (интерфейс) \r\n" +
 " 01:04:10 - Диспетчер взаимодействий (запросить блокировку оборудования) \r\n" +
 " 01:08:50 - Разбор ошибки (без отображения диспетчер идентификаторов - только клеммы)  \r\n" +
 " 01:12:15 - Разбор ошибки (пустой диспетчер идентификаторов после запроса блокировки)  \r\n" +
 " 01:31:45 - Разбор ошибки (без отображения диспетчер идентификаторов - только клеммы)  \r\n" +
 " 01:41:20 - Перерыв \r\n" +
 " 01:56:20 - Блокировка \r\n" +
 " 01:57:30 - Размещение	импортированного	оборудования \r\n" +
 " 02:03:25 - Размещение	распределительных	коробок \r\n" +
 " 02:09:30 - Создание новой конфигурации \r\n" +
 " 02:26:55 - Настройка положения курсора при размещении оборудования \r\n" +
 " 02:29:15 - Удаление оборудования \r\n" +
 " 02:30:25 - Размещение шкафа \r\n" +
 " 02:39:40 - Горячие клавиши \r\n" +
 " 02:42:00 - Размещение кабельного колодца \r\n" +
 " 02:59:00 - Построение подземной части кабельной трассы \r\n" +
 " 03:00:10 - Настройка системы распорок \r\n" +
 " 03:08:30 - Формирование массива кабелепроводов \r\n" +
 " 03:12:30 - Построение трассы ";

        #endregion

        #region "BRCM 1.2" 

        public static string sub32 =
 " 00:00:00 - Построение надземной части кабельной трассы \r\n" + 
 " 00:02:40 - Построение стандартной ветви \r\n" + 
 " 00:15:30 - Построение ветви с фитингами (делители) \r\n" + 
 " 00:27:40 - Вставка фитингов в готовый участок  \r\n" + 
 " 00:39:50 - Продление имеющейся трассы  \r\n" + 
 " 00:50:50 - Растяжение построенной трассы  \r\n" + 
 " 00:56:30 - Создание участков кабелепроводов \r\n" + 
 " 01:07:10 - Автоматическое соединение оборудования и трассы (автоматически размещать коллектор)  \r\n" + 
 " 01:17:20 - Перерыв \r\n" + 
 " 01:30:45 - Соединение участков кабельной трассы и проверка связности  \r\n" + 
 " 01:31:20 - Соединение участков трассы (вручную) \r\n" + 
 " 01:39:15 - Соединение участков трассы (вручную) \r\n" + 
 " 01:41:20 - Проверка целостности трассы \r\n" + 
 " 01:48:25 - Корректировка модели (продлить кабельный канал, маршрутизатор кабельного канала)  \r\n" + 
 " 02:06:00 - Вопрос (цвет труб) \r\n" + 
 " 02:09:20 - Вопрос (разный уровень	напряжения	в	лотках) \r\n" + 
 " 02:10:00 - Вопрос (окрашивание по	системам	(по	атрибутам) \r\n" + 
 " 02:12:30 - Вопрос (физический смысл уровня напряжения) \r\n" + 
 " 02:15:10 - Вопрос (опоры, кронштейны) \r\n" + 
 " 02:19:50 - Вопрос (хомуты, скобы) \r\n" + 
 " 02:24:06 - Вопрос (заземление) \r\n" + 
 " 02:36:27 - Вопрос (линейные объекты) \r\n" + 
 " 02:27:25 - Вопрос (гибкие трубы) \r\n" + 
 " 02:29:15 - Вопрос (расчеты) \r\n" + 
 " 02:30:50 - Корректировка модели (повторение) ";

        #endregion

        #region "BRCM 2.1" 

        public static string sub33 =
 " 00:02:15 - Частота распорок \r\n" +
 " 00:05:10 - Примыкание труб к оборудованию \r\n" +
 " 00:06:10 - Вопрос (фитинг на стыке трубы и оборудования) \r\n" +
 " 00:07:25 - Трассировка кабелей \r\n" +
 " 00:08:10 - Создание файла трассировки \r\n" +
 " 00:25:00 - Начало работы в Диспетчере кабелей \r\n" +
 " 00:38:20 - Редактирование сферы подключения \r\n" +
 " 00:54:00 - Автоматическое определение маршрута \r\n" +
 " 01:01:20 - Разбор ошибки (не трассируется кабель) \r\n" +
 " 01:14:20 - Создать кабель 3D \r\n" +
 " 01:32:35 - Вывод информации о степени заполненности лотка  \r\n" +
 " 01:36:30 - Разбор ошибки (все кабели в одну трубу)  \r\n" +
 " 01:49:40 - Перерыв \r\n" +
 " 02:01:20 - Разбор ошибки (все кабели в одну трубу)  \r\n" +
 " 02:06:00 - Визуализация степени заполнения лотков  \r\n" +
 " 02:17:00 - Получение чертежей \r\n" +
 " 02:23:55 - Работа с условно-графическими обозначениями  \r\n" +
 " 02:27:50 - Создание чертежа  \r\n" +
 " 03:02:10 - Создание сечений КНС ";

        #endregion

        #region "BRCM 2.2" 

        public static string sub34 =
 " 00:00:00 - Создание сечений КНС \r\n" +
 " 00:05:05 - Вывод информации по сечению (таблица) \r\n" +
 " 00:08:00 - Вывод информации по сечению (графически) \r\n" +
 " 00:11:40 - Дополнительное аннотирование чертежа (локализационный пакет)  \r\n" +
 " 00:12:30 - Установка локализации  \r\n" +
 " 00:28:55 - Импорт базы данных \r\n" +
 " 00:39:20 - Вопрос (элементы фиксации, стойки, опоры, консоли) \r\n" +
 " 00:45:20 - Работа с инструментами аннотирования \r\n" +
 " 00:47:20 - Аннотация \r\n" +
 " 00:54:20 - Выноска \r\n" +
 " 00:58:30 - Поток КНС \r\n" +
 " 01:03:11 - Создание отчета \r\n" +
 " 01:11:25 - Настройка шаблонов \r\n" +
 " 01:12:58 - Получение стандартных отчетов \r\n" +
 " 01:23:40 - Перерыв и тесты \r\n" +
 " 02:27:00 - Классифицирование модели по содержимому (диспетчер документов) \r\n" +
 " 02:27:30 - Сфера подключения (смысл) \r\n" +
 " 02:27:50 - Извлечение данных в 2D формате (УГО) \r\n" +
 " 02:28:15 - Изменить уровень напряжения простроенного лотка  \r\n" +
 " 02:28:30 - Причина, по которой не протрассировался кабель  \r\n" +
 " 02:29:26 - Как добавить оборудованию перекладину  \r\n" +
 " 02:31:30 - Вопрос (несколько точек подключения) \r\n" +
 " 02:34:35 - Размещение оборудования (связать с идентификатором) \r\n" +
 " 02:43:40 - Генератор кабельных каналов \r\n" +
 " 02:59:10 - Перемещение оборудования (обновление базы) \r\n" +
 " 03:02:55 - Диспетчер кабелей, диспетчер маршрутов  \r\n" +
 " 03:14:10 - Вопросы ";

        #endregion

        #region "BRCM 3.1" 

        public static string sub35 =
 " 00:01:45 - Описание структуры курса \r\n" +
 " 00:03:45 - Описание структуры папок и файлов программы \r\n" +
 " 00:05:30 - Переопределение путей к конфигурационным файлам с помощью переменных  \r\n" +
 " 00:07:36 - Использование MS SQL для работы с БД программы. Введение. \r\n" +
 " 00:12:52 - Перенос рабочих настроек проекта на другие компьютеры \r\n" +
 " 00:16:45 - Перенос БД на другие компьютеры \r\n" +
 " 00:20:26 - Практическая отработка экспорта БД \r\n" +
 " 00:23:00 - Импорт проекта с настройками \r\n" +
 " 00:25:00 - Импорт БД \r\n" +
 " 00:31:10 - Проверка правильности загрузки БД через MS SQL \r\n" +
 " 00:31:50 - Вопрос (Диспечер кабелей неактивен, кабели не загрузились)- решение: в выпадающем меню 'Процес надо выбрать 'Детальный проект' \r\n" +
 " 00:35:03 - Создание нового проекта \r\n" +
 " 00:35:53 - Создание нового набора настроек  \r\n" +
 " 00:36:01 - Ошибка (Файл шаблона не найден) \r\n" +
 " 00:47:44 - Извление 20-проекции из модели \r\n" +
 " 00:51:21 - Редактирование УГО (изменение штриховки и типа линии) \r\n" +
 " 01:01:15 - Вопрос (Для каких элементов применяется измененная штриховка) \r\n" +
 " 01:02:51 - Изменение стилей линии УГО \r\n" +
 " 01:08:20 - Определение файлов, в которых произошли изменения (в папке metadata) \r\n" +
 " 01:09:24 - Цветовая настройка для УГО разных уровней напряжения \r\n" +
 " 01:28:15 - Создание и редактирование уровней напряжения кабеля и кабельного канала  \r\n" +
 " 01:31:35 - Функция 'Свернуть все' в Notepad++ \r\n" +
 " 01:32:50 - Вопрос (Что записывается в файл Deltalmport.xml) \r\n" +
 " 01:36:11 - Задание уровней напряжения кабельного канала и связывание их с УН кабелей  \r\n" +
 " 01:41:03 - Вопрос (Можем ли мы разделять по напряжению массив кабельных конструкций) \r\n" +
 " 01:59:35 - Добавление новых типов кабелей \r\n" +
 " 02:08:56 - Импорт новых типов кабелей \r\n" +
 " 02:21:30 - Редактирование файла LIB_Cable.xml вручную, использование этого метода для добавления кабелей  \r\n" +
 " 02:30:41 - Импорт кабельного журнала из Promis.E, создание мэппинга импорта  \r\n" +
 " 02:58:39 - Создание пользовательских атрибутов \r\n" +
 " 03:13:10 - Редактирование файлов в папке ECShemas (для обеспечения корректного импорта) \r\n" +
 " 03:26:00 - Редактирование файла BRCM_OptionsDataConfig.xml ";

        #endregion

        #region "BRCM 3.2" 

        public static string sub36 =
 " 00:01:50 - Удаление имеющихся кабелей в Диспетчере кабелей \r\n" +
 " 00:05:52 - Ошибка (При открытии файла Routing выдает S1010 'Ошибка последовательности функций') - не решено  \r\n" +
 " 00:08:17 - Повторный импорт кабелей \r\n" +
 " 00:09:15 - Ошибка (Команда недоступна в этом файле проекта) - решение: Диспетчер документов-> выбрать значение 'Другое' \r\n" +
 " 00:20:20 - Ошибка (Импортированные данные отсутствуют) \r\n" +
 " 00:40:33 - Создание и редактирование атрибутов оборудования \r\n" +
 " 00:46:40 - Вопрос (Почему мы задаем атрибуты для кабеля вручную, меняя код, а для оборудования - через диспетчер) \r\n" +
 " 00:49:08 - Вопрос (Как проверить, что атрибуты оборудования добавлены корректно) \r\n" +
 " 00:50:35 - Создание и редактирование атрибутов лотков \r\n" +
 " 00:59:45 - Создание каталога кабельного канала (проверка добавленных атрибутов кабельного канала) \r\n" +
 " 01:16:43 - Создание отчета 'Кабельный журнал' \r\n" +
 " 01:18:44 - Редактирование файла DB_DataDictionary.xml \r\n" +
 " 01:25:41 - Создание нового шаблона отчета в Диспетчере выходных данных \r\n" +
 " 01:27:46 - Сохранение шаблона отчета \r\n" +
 " 01:32:30 - Редактирование шаблона отчета \r\n" +
 " 01:45:52 - Настройка шапки отчета \r\n" +
 " 01:48:39 - Размещение таблицы \r\n" +
 " 01:51:54 - Добавление столбцов \r\n" +
 " 01:58:30 - Подключение данных к столбцу \r\n" +
 " 02:09:13 - Предпросмотр отчета во вкладке Preview \r\n" +
 " 02:22:33 - Добавление группировки по уровню напряжения \r\n" +
 " 02:34:35 - Экспорт отчета в Excel \r\n" +
 " 02:36:23 - Перенос отчета из Excel в Word, для более наглядной и красивой визуализации данных ";

        #endregion

        #region "BRCM 4.1" 

        public static string sub37 =
 " 00:03:00 - Работа с вкладкой Создать/изменить оборудование, в Диспетчере оборудования  \r\n" +
 " 00:03:37 - Параметрический способ создания оборудования  \r\n" +
 " 00:06:16 - Назначение свойств оборудования и его уровней \r\n" +
 " 00:10:48 - Создание параметрического оборудования на основе шаблона CenterHungRod  \r\n" +
 " 00:11:17 - Назначение дополнительных свойств для оборудования (выбирая из вновь созданных) \r\n" +
 " 00:15:48 - Ошибка (Необрабатываемое исключение в компоненте приложения) (не решена) \r\n" +
 " 00:22:51 - Проверка корректности создания оборудования (должно создаться 2 файла) \r\n" +
 " 00:24:08 - Сохранение созданного оборудования и его размещение  \r\n" +
 " 00:32:05 - Создание оборудования на основе фрагментов  \r\n" +
 " 00:35:12 - Загрузка 2D фрагмента \r\n" +
 " 00:35:35 - Ошибка/предупреждение (Фрагмент с таким же именем уже существует в наборе...) \r\n" +
 " 00:39:15 - Загрузка 3D фрагмента \r\n" +
 " 00:41:29 - Назначение свойств оборудования (атрибутов) \r\n" +
 " 00:47:20 - Обновление БД и создание отчета, для проверки 'прописки' оборудования в БД  \r\n" +
 " 00:56:08 - Добавление дополнительных элементов к объектам (например анкеры к скобе) \r\n" +
 " 01:25:35 - Добавление дополнительных элементов к уровням объектов \r\n" +
 " 01:26:56 - Создание и редактирование лотков \r\n" +
 " 01:28:33 - Создание каталога кабельного канала \r\n" +
 " 01:56:40 - Добавление фитингов для кабельных каналов \r\n" +
 " 02:03:51 - Проверка созданного каталога в папке raceway \r\n" +
 " 02:06:40 - Редактирование каталога кабельных каналов \r\n" +
 " 02:07:50 - Задание атрибутов для каталога кабельных каналов \r\n" +
 " 02:10:10 - Посторение участка трассы с использованием вновь созданного каталога  \r\n" +
 " 02:15:18 - Проверка отображения размещенного оборудования в отчете \r\n" +
 " 02:19:18 - Задание дополнительных элементов для каждого типа участка трассы (прямая, поворот, Т-ответвление и т.д.) \r\n" +
 " 02:26:30 - Построение лотка и автоматическое добавление к нему определенных элементов на основании совпадения атрибута \r\n" +
 " 02:29:40 - Редактирование файла ...PCode_EN.xml для добавления элементов  \r\n" +
 " 02:48:30 - Вывод отчета Detal_BOQ (спецификация оборудования) \r\n" +
 " 02:57:04 - Использование переменных для ввода материала, ширины крышки и др. атрибуты  \r\n" +
 " 03:04:02 - Создание пользовательских кнопок в BRCM Microstation MODE \r\n" +
 " 03:04:25 - Создание библиотеки с расширением .dgnlib  \r\n" +
 " 03:16:20 - Подключение файла с пользовательскими кнопками \r\n" +
 " 03:19:13 - Вопрос (Можем ли мы передавать коллизии между разными ПО Microstation) \r\n" +
 " 03:20:12 - Включение пользовательских кнопок в панель инструментов \r\n" +
 " 03:33:20 - Уточнение файла библиотеки, откуда подгружена кнопка (внутеннее имя и источник) ";

        #endregion

        #region "BRCM 4.2" 

        public static string sub38 =
 " 00:03:42 - Редактирование стилей текста  \r\n" +
 " 00:06:59 - Размещение текста в штампе  \r\n" +
 " 00:10:45 - Редактирование стилей размеров  \r\n" +
 " 00:14:45 - Размещение размеров (пример) \r\n" +
 " 00:16:00 - Назначение кнопке Esc функции 'Выход из текущей операции' \r\n" +
 " 00:18:00 - Редактирование пользовательских стилей линий  \r\n" +
 " 00:22:34 - Создание штрихового трафарета линии \r\n" +
 " 00:28:50 - Вставка графических элементов в трафарет (точечный компонент) \r\n" +
 " 00:39:41 - Совмещение точечного и штрихового элементов линии в один элемент (составной компонент)  \r\n" +
 " 00:42:14 - Связка составного компонента с названием стиля линии \r\n" +
 " 00:43:31 - Прописывание пути к вновь созданному типу линии в Окне конфигурационных переменных  \r\n" +
 " 00:47:35 - Проверка работы вновь созданного стиля линии  \r\n" +
 " 01:06:51 - Ответы на вопросы теста \r\n" +
 " 01:09:50 - Вопрос (Как ускорить ввод оборудования в программу) ";

        #endregion


        #region "Обучение MicroStation. Пользователи 1.1" 

        public static string sub41 =
 " 00:05:46 - О программе MicroStation \r\n" +
 " 00:08:00 - Интерфейс \r\n" +
 " 00:12:28 - Строка поиска \r\n" +
 " 00:13:45 - Создание файла в MicroStation, рабочая область, рабочий набор \r\n" +
 " 00:17:40 - Создание рабочей области \r\n" +
 " 00:25:07 - Создание рабочего набора \r\n" +
 " 00:28:45 - Создание файла на основе прототипа \r\n" +
 " 00:39:14 - Построение SmartLine \r\n" +
 " 00:41:00 - Компас AccuDraw \r\n" +
 " 00:45:00 - Упражнение трапеция на использование AccuDraw \r\n" +
 " 01:05:17 - Построение линии с привязками, использование калькулятора \r\n" +
 " 01:18:00 - Инструменты манипулирования (поворот, копирование, отражение) \r\n" +
 " 01:34:22 - Упражнение на тренировку навигации в 3D виде \r\n" +
 " 02:14:48 - Выбор вида, переход в 3D вид \r\n" +
 " 02:16:00 - Менеджер слоев \r\n" +
 " 02:17:17 - Отображение слоев \r\n" +
 " 02:18:10 - Создание слоев \r\n" +
 " 02:21:19 - Обзор курсового задания Подстанция \r\n" +
 " 02:21:50 - Создание фундамента \r\n" +
 " 02:22:27 - Параллелепипед \r\n" +
 " 02:29:30 - Построение стен \r\n" +
 " 02:20:35 - Прямоугольник \r\n" +
 " 02:47:19 - Выдавливание прямоугольников, инструмент Вытягивание \r\n" +
 " 02:53:30 - Перемещение объектов из слоя в слой \r\n" +
 " 02:55:49 - Окна \r\n" +
 " 03:08:07 - Инструмент Разрез (вырезание проема) \r\n" +
 " 03:14:11 - Крыша ";

        #endregion

        #region "Обучение MicroStation. Пользователи 1.2" 

        public static string sub42 =
 " 00:02:30 - Параметрические объекты \r\n" +
 " 00:03:40 - Балки \r\n" +
 " 00:06:04 - Зависимости и ограничения \r\n" +
 " 00:07:40 - Построение сечения для балки (уголок с зависимостями) \r\n" +
 " 00:21:27 - Переменные для уголка, создание переменных \r\n" +
 " 00:27:30 - Применение переменных к уголку, ограничение по элементу \r\n" +
 " 00:32:36 - Библиотека фрагментов, создание файла .cel \r\n" +
 " 00:42:00 - Размещение уголка в библиотеке \r\n" +
 " 00:42:48 - Определение базовой точки \r\n" +
 " 00:50:13 - Размещение фрагмента из библиотеки \r\n" +
 " 00:52:04 - Подключение библиотеки в файл Подстанция \r\n" +
 " 00:54:21 - Копирование элементов \r\n" +
 " 01:06:04 - Пользовательские атрибуты  \r\n" +
 " 01:07:32 - Добавление свойств элементам. Типы элементов \r\n" +
 " 01:20:13 - Назначение атрибутов балкам. Подсоединить элемент \r\n" +
 " 01:41:50 - Стили отображения \r\n" +
 " 01:46:16 - Сохранённые виды \r\n" +
 " 01:53:55 - Объем отсечения, секущая плоскость \r\n" +
 " 01:55:49 - Шаг отсечения \r\n" +
 " 01:57:27 - Настройка отображения в объеме отсечения \r\n" +
 " 02:17:59 - Маска отсечения \r\n" +
 " 02:25:36 - Отображаемый набор \r\n" +
 " 02:27:55 - Правила для стилей отображения (окрашивание балок по сроку службы) ";

        #endregion

        #region "Обучение MicroStation. Пользователи 2.1" 

        public static string sub43 =

 " 00:02:00 - Замена фрагментов из библиотеки \r\n" +
 " 00:05:43 - Разделение элемента \r\n" +
 " 00:13:27 - Работа с файлами смежников \r\n" +
 " 00:14:29 - Менеджер ассоциированных моделей \r\n" +
 " 00:15:45 - Подключение ассоциированной модели \r\n" +
 " 00:20:06 - Инструменты работы с ассоциированной моделью \r\n" +
 " 00:23:13 - Референсы \r\n" +
 " 00:24:00 - Команда Перейти в ассоциированную модель \r\n" +
 " 00:25:28 - Активировать ассоциированную модель \r\n" +
 " 00:26:20 - Слияние в основной \r\n" +
 " 00:30:37 - Вложенная структура референсов \r\n" +
 " 00:48:50 - Отсечение ассоциированной модели \r\n" +
 " 00:55:34 - Менеджер коллизий \r\n" +
 " 01:04:03 - Создание проема для вентиляции \r\n" +
 " 01:05:00 - Устранение коллизии \r\n" +
 " 01:07:48 - Проводник \r\n" +
 " 01:15:58 - Поиск по атрибутам \r\n" +
 " 01:18:18 - Расширенный поиск \r\n" +
 " 01:49:33 - Граница отсечения и маска отсечения \r\n" +
 " 01:56:30 - Вывод на лист \r\n" +
 " 01:58:08 - Инструмент План \r\n" +
 " 02:02:16 - Инструмент Разрез \r\n" +
 " 02:04:39 - Инструмент Узел \r\n" +
 " 02:06:56 - Схема процесса создания чертежей в MicroStation \r\n" +
 " 02:10:16 - Модели \r\n" +
 " 02:19:46 - Вынос на лист \r\n" +
 " 02:23:50 - Создание плана \r\n" +
 " 02:36:20 - Размер элемента \r\n" +
 " 02:37:51 - Вынос чертежа на лист ";

        #endregion

        #region "Обучение MicroStation. Пользователи 2.2" 

        public static string sub44 =

 " 00:00:40 - Размеры \r\n" +
 " 00:01:45 - Перемещение референса на листе \r\n" +
 " 00:09:20 - Схема создания листа \r\n" +
 " 00:10:43 - Измерение расстояния \r\n" +
 " 00:11:29 - Масштаб аннотаций \r\n" +
 " 00:17:24 - Разрез, вывод чертежа в новый файл \r\n" +
 " 00:24:59 - Создание файла листа \r\n" +
 " 00:26:22 - Подключение в файл листа ассоциированной модели из файла чертежа \r\n" +
 " 00:29:02 - 4 вида файлов для сборки \r\n" +
 " 00:37:49 - Величина выносок и обозначений (масштаб аннотаций). Различия плана и разреза ";

        #endregion

        #region "Обучение MicroStation. Пользователи 2.3" 

        public static string sub45 =

 " 00:00:37 - Вопрос про виды файлов для компоновки листа \r\n" +
 " 00:03:26 - Совмещение на листе разреза и узла \r\n" +
 " 00:12:06 - Масштаб аннотаций, текст \r\n" +
 " 00:17:05 - Инструментальные панели (Ctrl+P) \r\n" +
 " 00:23:24 - Совмещение двух планов на одном чертеже \r\n" +
 " 00:37:29 - Открытие чертежа с помощью быстрого меню \r\n" +
 " 00:44:59 - Размеры элементов \r\n" +
 " 00:47:14 - Настройки отображения в объеме отсечения \r\n" +
 " 00:50:38 - Создание узла \r\n" +
 " 00:59:40 - Изменение рабочих единиц модели через проводник (изменение футов на мм) \r\n" +
 " 01:03:43 - Размещение узла на листе \r\n" +
 " 01:07:21 - Применение стиля отображения к сохраненному виду, переопределение символики \r\n" +
 " 01:18:37 - Изменение атрибутов отображения для ассоциированного файла \r\n" +
 " 01:27:36 - Сброс к глобальной системе координат \r\n" +
 " 01:42:57 - Текст, стили текста \r\n" +
 " 01:45:02 - Установка шрифта GOST \r\n" +
 " 01:48:23 - Размещение текста в штампе чертежа \r\n" +
 " 01:53:05 - Редактор полей, тип поля, создание изменяемых полей (размер листа) \r\n" +
 " 02:00:01 - Изменение формата листа через свойства \r\n" +
 " 02:02:00 - Простановка размеров, стили размера \r\n" +
 " 02:03:49 - Инструмент Размер элемента, ручное размещение \r\n" +
 " 02:06:52 - Инструмент Линейный размер \r\n" +
 " 02:15:15 - Редактирование размеров, модификация элементов \r\n" +
 " 02:19:45 - Изменение размерного стиля, инструмент Изменить или согласовать размер \r\n" +
 " 02:20:35 - Размещение выноски и размещение метки \r\n" +
 " 02:22:23 - Совмещение текста и УГО (выноска показывающая объем стен) \r\n" +
 " 02:28:10 - Размещение выноски в библиотеку фрагментов \r\n" +
 " 02:34:42 - Размещение метки на чертеже \r\n" +
 " 02:47:51 - Печать, Ctrl+P, печать выделенной области в .pdf \r\n" +
 " 02:53:18 - Пакетная печать, менеджер печати ";

        #endregion


        public static string GetFromFile(string path, string name)
        {

            StringBuilder sb_result = new StringBuilder();
  
            string s1 = Path.Combine(path, "video", "sub", name);

            if (File.Exists(s1))
            {

                string from_t = File.ReadAllText(s1, CodePagesEncodingProvider.Instance.GetEncoding(1251));

                if (from_t.Trim() == "")
                {
                    sb_result.AppendLine(" 00:00:00 - Начало урока");
                    sb_result.AppendLine(" 00:01:00 - Субтитры в процессе создания..");
                }
                else
                {
                    //(!Regex.IsMatch(from_t, "^[А-Яа-я]+$"))
                    if ((!from_t.Contains("а")) && (!from_t.Contains("б")) && (!from_t.Contains("о")))
                    {
                        //возможно, ошибка в кодировке
                        //пробуем utf8
                        sb_result.AppendLine(" 00:00:00 - Кодировка UTF-8");
                        from_t = File.ReadAllText(s1, System.Text.Encoding.UTF8);
                    }

                    if ((!from_t.Contains("а")) && (!from_t.Contains("б")) && (!from_t.Contains("о")))
                    {
                        //неизвестная кодировка
                        sb_result.AppendLine(" 00:00:00 - Начало урока");
                        sb_result.AppendLine(" 00:01:00 - Ошибка в кодировкке..");
                    }
                    else
                    {
                        string[] from_arr = from_t.Split(
                                            new[] { "\r\n", "\r", "\n" },
                                            StringSplitOptions.None
                                        );

                        foreach (string s in from_arr)
                        {
                            try
                            {
                                bool istruetime = Regex.IsMatch(s,
                                      @"^[0-9]{1}[0-9:]{2}[0-9]{1}[0-9:]{2}[0-9]{1,2} [-]{1}[^\r\n]*$",
                                    RegexOptions.IgnoreCase, TimeSpan.FromMilliseconds(50));
                                if (istruetime)
                                {
                                    string s_temp = RecursiveHtmlDecode(s);
                                    if (s_temp.Contains("\"")) { s_temp = s_temp.Replace("\"", "'"); }
                                    if (s_temp.Trim() != "") { sb_result.AppendLine(s_temp); }
                                }
                                else
                                {
                                    //sb_result.AppendLine(" 00:00:00 - СТРОКА С ОШИБКОЙ");
                                }
                            }
                            catch (RegexMatchTimeoutException)
                            {
                                //при ошибке - пропускаем строку
                            }
                        }
                    }
                }
            }
            else
            {
                sb_result.AppendLine(" 00:00:00 - Начало урока");
                sb_result.AppendLine(" 00:01:00 - Субтитры в процессе создания..");
            }

            if (sb_result.ToString().Length>2)
            {
                return sb_result.ToString().Remove(sb_result.ToString().Length - 2);
            }
            else
            {
                sb_result.AppendLine(" 00:00:00 - Начало урока");
                sb_result.AppendLine(" 00:01:00 - Субтитры в процессе создания..");
                return sb_result.ToString();
            }


            
        }


       
        public static String convertMsToHMmSs(string path, string filename)
        {

            string s1 = Path.Combine(path, "video", filename);

            if (File.Exists(s1))
            {
                IEnumerable<MetadataExtractor.Directory> directories =
                ImageMetadataReader.ReadMetadata(s1);

                var subIfdDirectory =
                    directories?.OfType<MetadataExtractor.Formats.QuickTime.QuickTimeMovieHeaderDirectory>().FirstOrDefault();

                var dateTime =
                    subIfdDirectory?.GetDescription(MetadataExtractor.Formats.QuickTime.QuickTimeMovieHeaderDirectory.TagDuration);

                if (dateTime != null)
                {
                    int index = dateTime.IndexOf(".");
                    return (index > 0 ? dateTime.Substring(0, index) : dateTime);
                }
                else
                {
                    return "00:01:00";
                }
            }
            else
            {
                return "00:01:00";
            }
            
        }

        public static string RecursiveHtmlDecode(string str)
        {
            if (string.IsNullOrWhiteSpace(str)) return str;
            var tmp = HttpUtility.HtmlDecode(str);
            while (tmp != str)
            {
                str = tmp;
                tmp = HttpUtility.HtmlDecode(str);
            }
            return str;
        }


        /// <summary>
        /// return the detected encoding and the contents of the file.
        /// </summary>
        /// <param name="fileName"></param>
        /// <param name="contents"></param>
        /// <returns></returns>
        public static Encoding DetectEncoding(String fileName, out String contents)
        {
            // open the file with the stream-reader:
            using (StreamReader reader = new StreamReader(fileName, true))
            {
                // read the contents of the file into a string
                contents = reader.ReadToEnd();

                // return the encoding.
                return reader.CurrentEncoding;
            }
        }

    }
}

//var dateTime = subIfdDirectory?.GetDescription(5);
//Core.Initialize();
//using var libVLC = new LibVLC();
//using var media = new Media(libVLC, new Uri("http://commondatastorage.googleapis.com/gtv-videos-bucket/sample/ElephantsDream.mp4"));

